OF21x/ALM21/constant/airfoilProperties/DU202-OF
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//alpha   C_l      C_d

( -180 0 0.0188466666666667 )
( -175 0.388666666666667 0.03344 )
( -170 0.7776 0.0947666666666667 )
( -160 0.667066666666667 0.280846666666667 )
( -155 0.745533333333333 0.392853333333333 )
( -150 0.793266666666667 0.510506666666667 )
( -145 0.814 0.62978 )
( -140 0.809 0.746953333333333 )
( -135 0.782 0.8592 )
( -130 0.735 0.964073333333333 )
( -125 0.671 1.05967333333333 )
( -120 0.592 1.14437333333333 )
( -115 0.501266666666667 1.21697333333333 )
( -110 0.399533333333333 1.27652666666667 )
( -105 0.2908 1.32220666666667 )
( -100 0.176333333333333 1.35361333333333 )
( -95 0.0578666666666667 1.3704 )
( -90 -0.0618666666666667 1.37241333333333 )
( -85 -0.180333333333333 1.35968 )
( -80 -0.296066666666667 1.3324 )
( -75 -0.407533333333333 1.29094666666667 )
( -70 -0.512 1.23564666666667 )
( -65 -0.607466666666667 1.16735333333333 )
( -60 -0.691933333333333 1.08688666666667 )
( -55 -0.762666666666667 0.9954 )
( -50 -0.8184 0.894466666666667 )
( -45 -0.855133333333333 0.785786666666667 )
( -40 -0.8726 0.67156 )
( -35 -0.8666 0.554486666666667 )
( -30 -0.8356 0.437566666666667 )
( -25 -0.807533333333333 0.320666666666667 )
( -24 -0.814266666666667 0.295993333333333 )
( -23 -0.827666666666667 0.270706666666667 )
( -22 -0.845 0.245026666666667 )
( -21 -0.867266666666667 0.219106666666667 )
( -20 -0.892733333333333 0.19302 )
( -19 -0.921133333333333 0.16704 )
( -18 -0.950733333333333 0.141193333333333 )
( -17 -0.995466666666667 0.115433333333333 )
( -16 -1.0294 0.0898933333333333 )
( -15 -1.0522 0.0647933333333333 )
( -14.5 -1.06106666666667 0.0524866666666667 )
( -12.01 -0.940229333333333 0.0234512 )
( -11 -0.8752 0.0254466666666667 )
( -9.98 -0.795448 0.0240002666666667 )
( -8.12 -0.524277333333333 0.0115456 )
( -7.62 -0.459496 0.0103693333333333 )
( -7.11 -0.391221333333333 0.00905466666666667 )
( -6.6 -0.325026666666667 0.00833733333333333 )
( -6.5 -0.313266666666667 0.00876666666666667 )
( -6 -0.250066666666667 0.0082 )
( -5.5 -0.185866666666667 0.00757333333333333 )
( -5 -0.123133333333333 0.00716666666666667 )
( -4.5 -0.0576 0.00678 )
( -4 0.00719999999999999 0.00654 )
( -3.5 0.0681333333333333 0.00628666666666667 )
( -3 0.1298 0.00596 )
( -2.5 0.192666666666667 0.00575333333333333 )
( -2 0.2548 0.00562 )
( -1.5 0.316333333333333 0.00559333333333333 )
( -1 0.377866666666667 0.00556666666666667 )
( -0.5 0.438533333333333 0.00556666666666667 )
( 0 0.499933333333333 0.00556666666666667 )
( 0.5 0.5606 0.00556666666666667 )
( 1 0.621266666666667 0.00564 )
( 1.5 0.6812 0.00565333333333333 )
( 2 0.741866666666667 0.00574 )
( 2.5 0.801066666666667 0.00588666666666667 )
( 3 0.860266666666667 0.00603333333333333 )
( 3.5 0.919466666666667 0.00626666666666667 )
( 4 0.969866666666667 0.00664666666666667 )
( 4.5 1.0216 0.00728666666666667 )
( 5 1.0726 0.00814666666666666 )
( 5.5 1.12153333333333 0.00954 )
( 6 1.16826666666667 0.0107133333333333 )
( 6.5 1.21313333333333 0.0116666666666667 )
( 7 1.2558 0.01262 )
( 7.5 1.296 0.0133533333333333 )
( 8 1.33106666666667 0.0140866666666667 )
( 8.5 1.36046666666667 0.0150533333333333 )
( 9 1.38246666666667 0.0169 )
( 9.5 1.389 0.0192866666666667 )
( 10 1.3644 0.0227 )
( 10.5 1.3362 0.0291933333333333 )
( 11 1.32113333333333 0.03566 )
( 11.5 1.31426666666667 0.0426866666666667 )
( 12 1.3152 0.0506666666666667 )
( 12.5 1.31833333333333 0.0593533333333333 )
( 13 1.32046666666667 0.0688466666666667 )
( 13.5 1.321 0.0783866666666667 )
( 14 1.31893333333333 0.0875066666666667 )
( 14.5 1.3186 0.09736 )
( 15 1.32033333333333 0.1067 )
( 15.5 1.32526666666667 0.116113333333333 )
( 16 1.32773333333333 0.12604 )
( 16.5 1.33546666666667 0.136306666666667 )
( 17 1.3412 0.1464 )
( 17.5 1.34293333333333 0.156346666666667 )
( 18 1.34533333333333 0.166466666666667 )
( 18.5 1.3464 0.17688 )
( 19 1.34533333333333 0.187533333333333 )
( 19.5 1.34193333333333 0.198306666666667 )
( 20 1.3422 0.209153333333333 )
( 20.5 1.34886666666667 0.220253333333333 )
( 21 1.34453333333333 0.231426666666667 )
( 22 1.29886666666667 0.2579 )
( 23 1.24793333333333 0.284413333333333 )
( 24 1.19213333333333 0.311086666666667 )
( 25 1.14453333333333 0.33726 )
( 26 1.09913333333333 0.363466666666667 )
( 28 1.01646666666667 0.4158 )
( 30 0.9524 0.46746 )
( 32 0.915133333333333 0.51784 )
( 35 0.9078 0.591286666666667 )
( 40 0.911066666666667 0.714426666666667 )
( 45 0.892 0.8343 )
( 50 0.851733333333333 0.948313333333333 )
( 55 0.793266666666667 1.05425333333333 )
( 60 0.7176 1.15018666666667 )
( 65 0.628933333333333 1.23474 )
( 70 0.528 1.30679333333333 )
( 75 0.4178 1.36539333333333 )
( 80 0.300533333333333 1.40972 )
( 85 0.1782 1.43912666666667 )
( 90 0.053 1.45261333333333 )
( 95 -0.0732666666666667 1.44941333333333 )
( 100 -0.198266666666667 1.43076 )
( 105 -0.319533333333333 1.39673333333333 )
( 110 -0.434533333333333 1.34768 )
( 115 -0.541533333333333 1.2841 )
( 120 -0.6378 1.20682 )
( 125 -0.7208 1.11674 )
( 130 -0.7878 1.01533333333333 )
( 135 -0.837066666666667 0.904126666666667 )
( 140 -0.865066666666667 0.785193333333333 )
( 145 -0.8698 0.661086666666667 )
( 150 -0.8478 0.535053333333333 )
( 155 -0.7958 0.410646666666667 )
( 160 -0.7118 0.29244 )
( 170 -0.7776 0.0969533333333333 )
( 175 -0.388666666666667 0.0334 )
( 180 0 0.0188466666666667 )
); // // // //
