OF21x/ALM21/constant/airfoilProperties/DU260-OF
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//alpha   C_l      C_d

( -180 0 0.0230555555555556 )
( -175 0.327333333333333 0.0353111111111111 )
( -170 0.654111111111111 0.0957777777777778 )
( -160 0.678333333333333 0.284622222222222 )
( -155 0.758444444444444 0.398366666666667 )
( -150 0.807555555555556 0.517866666666667 )
( -145 0.828 0.638955555555555 )
( -140 0.823555555555555 0.758 )
( -135 0.796 0.872033333333333 )
( -130 0.748444444444444 0.978555555555556 )
( -125 0.683333333333333 1.07561111111111 )
( -120 0.603222222222222 1.16171111111111 )
( -115 0.510555555555556 1.23548888888889 )
( -110 0.407444444444444 1.296 )
( -105 0.297333333333333 1.34244444444444 )
( -100 0.180666666666667 1.37447777777778 )
( -95 0.0605555555555556 1.39164444444444 )
( -90 -0.0605555555555556 1.39384444444444 )
( -85 -0.181222222222222 1.38107777777778 )
( -80 -0.298888888888889 1.3536 )
( -75 -0.412 1.31164444444444 )
( -70 -0.518111111111111 1.25573333333333 )
( -65 -0.615777777777778 1.18655555555556 )
( -60 -0.701333333333333 1.10506666666667 )
( -55 -0.773444444444444 1.01231111111111 )
( -50 -0.83 0.909944444444444 )
( -45 -0.868111111111111 0.799666666666667 )
( -40 -0.886111111111111 0.683733333333333 )
( -35 -0.880111111111111 0.564788888888889 )
( -30 -0.849111111111111 0.445944444444444 )
( -25 -0.813777777777778 0.331211111111111 )
( -24 -0.826222222222222 0.308744444444444 )
( -23 -0.847777777777778 0.286422222222222 )
( -22 -0.875444444444444 0.264266666666667 )
( -21 -0.909666666666667 0.242377777777778 )
( -20 -0.949 0.2208 )
( -19 -0.992333333333333 0.199666666666667 )
( -18 -1.03877777777778 0.178977777777778 )
( -17 -1.08677777777778 0.158811111111111 )
( -16 -1.13566666666667 0.139222222222222 )
( -15.25 -1.172 0.125022222222222 )
( -14.24 -1.14494288264168 0.104992994199018 )
( -13.24 -1.08262918340027 0.0887096385542169 )
( -12.22 -1.0116358768407 0.0715428380187416 )
( -11.22 -0.94124202420242 0.062379097909791 )
( -10.19 -0.855901960784314 0.0540130718954248 )
( -9.7 -0.804752688172043 0.0496649940262843 )
( -9.18 -0.739150537634409 0.0432507765830346 )
( -8.18 -0.662394265232975 0.0207448028673835 )
( -7.19 -0.563159041394335 0.0142074074074074 )
( -6.65 -0.48882788671024 0.0129503267973856 )
( -6.13 -0.417626666666667 0.0121697777777778 )
( -6 -0.400555555555556 0.0101444444444444 )
( -5.5 -0.329666666666667 0.00912222222222222 )
( -5 -0.262444444444444 0.00845555555555556 )
( -4.5 -0.195777777777778 0.008 )
( -4 -0.132333333333333 0.00785555555555556 )
( -3.5 -0.0694444444444444 0.00765555555555556 )
( -3 -0.00222222222222221 0.00752222222222222 )
( -2.5 0.0641111111111111 0.00742222222222222 )
( -2 0.129444444444444 0.00742222222222222 )
( -1.5 0.195222222222222 0.00742222222222222 )
( -1 0.260444444444444 0.00742222222222222 )
( -0.5 0.325222222222222 0.00742222222222222 )
( 0 0.391555555555556 0.00736666666666667 )
( 0.5 0.455777777777778 0.00736666666666667 )
( 1 0.520555555555556 0.00746666666666667 )
( 1.5 0.584333333333333 0.00752222222222222 )
( 2 0.649111111111111 0.00762222222222222 )
( 2.5 0.711888888888889 0.00776666666666667 )
( 3 0.775222222222222 0.00791111111111111 )
( 3.5 0.837444444444444 0.0081 )
( 4 0.895444444444444 0.00843333333333333 )
( 4.5 0.953222222222222 0.00884444444444444 )
( 5 1.01111111111111 0.00938888888888889 )
( 5.5 1.06888888888889 0.0100777777777778 )
( 6 1.12533333333333 0.0106333333333333 )
( 6.5 1.18122222222222 0.0111444444444444 )
( 7 1.23522222222222 0.0117666666666667 )
( 7.5 1.28622222222222 0.0124 )
( 8 1.32855555555556 0.0134777777777778 )
( 9 1.39577777777778 0.0166555555555556 )
( 9.5 1.41377777777778 0.0188777777777778 )
( 10 1.41355555555556 0.022 )
( 10.5 1.41022222222222 0.0255444444444444 )
( 11 1.412 0.0295888888888889 )
( 11.5 1.41788888888889 0.0348777777777778 )
( 12 1.42588888888889 0.0413555555555556 )
( 12.5 1.43133333333333 0.0493333333333333 )
( 13 1.38244444444444 0.0631333333333333 )
( 13.5 1.34244444444444 0.0756444444444444 )
( 14 1.31755555555556 0.0875444444444445 )
( 14.5 1.308 0.100055555555556 )
( 15 1.30722222222222 0.1127 )
( 15.5 1.306 0.126388888888889 )
( 16 1.309 0.140444444444444 )
( 16.5 1.31266666666667 0.153277777777778 )
( 17 1.31433333333333 0.166522222222222 )
( 17.5 1.32077777777778 0.178622222222222 )
( 18 1.32188888888889 0.190866666666667 )
( 18.5 1.32577777777778 0.203066666666667 )
( 19 1.338 0.215055555555556 )
( 19.5 1.34866666666667 0.227022222222222 )
( 20 1.35933333333333 0.2377 )
( 20.5 1.38111111111111 0.249666666666667 )
( 21 1.38677777777778 0.2619 )
( 22 1.35533333333333 0.2914 )
( 23 1.32233333333333 0.321433333333333 )
( 24 1.28977777777778 0.352033333333333 )
( 25 1.25711111111111 0.383044444444444 )
( 26 1.22577777777778 0.414177777777778 )
( 28 1.17033333333333 0.476655555555556 )
( 30 1.13033333333333 0.538522222222222 )
( 32 1.11255555555556 0.598711111111111 )
( 35 1.12311111111111 0.685533333333333 )
( 40 1.12111111111111 0.827044444444444 )
( 45 1.08855555555556 0.961133333333333 )
( 50 1.02955555555556 1.08393333333333 )
( 55 0.947666666666667 1.19198888888889 )
( 60 0.846666666666667 1.28243333333333 )
( 65 0.731 1.35336666666667 )
( 70 0.605 1.40325555555556 )
( 75 0.471666666666667 1.43164444444444 )
( 80 0.336222222222222 1.4392 )
( 85 0.202333333333333 1.42968888888889 )
( 90 0.0746666666666667 1.41931111111111 )
( 95 -0.0491111111111111 1.41816666666667 )
( 100 -0.171333333333333 1.40184444444444 )
( 105 -0.290111111111111 1.3704 )
( 110 -0.403444444444444 1.32412222222222 )
( 115 -0.508777777777778 1.26356666666667 )
( 120 -0.604222222222222 1.18936666666667 )
( 125 -0.686666666666667 1.10247777777778 )
( 130 -0.753666666666667 1.00428888888889 )
( 135 -0.803222222222222 0.896244444444444 )
( 140 -0.832333333333333 0.780388888888889 )
( 145 -0.839 0.659166666666667 )
( 150 -0.819222222222222 0.5356 )
( 155 -0.77 0.4133 )
( 160 -0.689888888888889 0.296533333333333 )
( 170 -0.654111111111111 0.101455555555556 )
( 175 -0.327333333333333 0.0364 )
( 180 0 0.0230555555555556 )
); // // // //
