OF21x/ALM21/constant/airfoilProperties/DU331-OF
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//alpha   C_l      C_d

( -180 0 0.03538 )
( -175 0.24238 0.045494 )
( -170 0.45896 0.102194 )
( -160 0.66826 0.294172 )
( -155 0.74554 0.408452 )
( -150 0.79244 0.527912 )
( -145 0.81058 0.648438 )
( -140 0.8041 0.766592 )
( -135 0.77486 0.879336 )
( -130 0.72624 0.984294 )
( -125 0.65962 1.07959 )
( -120 0.57862 1.1637 )
( -115 0.48524 1.235372 )
( -110 0.38248 1.293706 )
( -105 0.2721 1.337964 )
( -100 0.15534 1.367784 )
( -95 0.0362 1.382728 )
( -90 -0.08394 1.38282 )
( -85 -0.20346 1.36806 )
( -80 -0.31998 1.338748 )
( -75 -0.4315 1.295046 )
( -70 -0.53602 1.237654 )
( -65 -0.63192 1.167296 )
( -60 -0.71544 1.084848 )
( -55 -0.78534 0.991496 )
( -50 -0.83924 0.888816 )
( -45 -0.87576 0.778694 )
( -40 -0.89128 0.663244 )
( -35 -0.88342 0.545252 )
( -30 -0.85056 0.427856 )
( -25 -0.80224 0.315426 )
( -24 -0.79992 0.29424 )
( -23 -0.80078 0.273644 )
( -22 -0.80368 0.253624 )
( -21 -0.80862 0.234218 )
( -20 -0.8146 0.215426 )
( -19 -0.82148 0.197248 )
( -18 -0.82926 0.179808 )
( -17 -0.83718 0.163068 )
( -16 -0.84572 0.147252 )
( -15.25 -0.85259 0.1360545 )
( -14.24 -0.816576 0.1196756 )
( -13.24 -0.773396 0.10372704 )
( -12.22 -0.724268 0.08774372 )
( -11.22 -0.678808 0.07442804 )
( -10.19 -0.6292982 0.06239422 )
( -9.7 -0.605998116591928 0.0578947533632287 )
( -9.18 -0.578990852017937 0.0528036591928251 )
( -8.18 -0.560844573991031 0.0360561704035874 )
( -7.19 -0.522690358744395 0.0286588565022422 )
( -6.65 -0.487438968609865 0.0259574125560538 )
( -6.13 -0.452451704035874 0.0233363183856502 )
( -6 -0.444274887892377 0.0214840448430493 )
( -5.5 -0.4087904 0.0190808 )
( -5 -0.3677896 0.01749216 )
( -4.5 -0.342272 0.01553888 )
( -4 -0.3130992 0.01418648 )
( -3.5 -0.2591344 0.01333672 )
( -3 -0.1944 0.018262 )
( -2.5 -0.12044 0.015 )
( -2 -0.04996 0.013264 )
( -1.5 0.02052 0.011838 )
( -1 0.09 0.01066 )
( -0.5 0.15824 0.009792 )
( 0 0.23096 0.009134 )
( 0.5 0.29882 0.009258 )
( 1 0.36768 0.00942 )
( 1.5 0.43554 0.00952 )
( 2 0.50316 0.00962 )
( 2.5 0.57002 0.009782 )
( 3 0.63726 0.009882 )
( 3.5 0.7025 0.009982 )
( 4 0.76974 0.01012 )
( 4.5 0.8356 0.010282 )
( 5 0.90122 0.010382 )
( 5.5 0.96646 0.01052 )
( 6 1.0317 0.010658 )
( 6.5 1.09532 0.01092 )
( 7 1.15794 0.011196 )
( 7.5 1.22004 0.01151 )
( 8 1.2771 0.01219 )
( 9 1.37636 0.014136 )
( 9.5 1.42276 0.015364 )
( 10 1.46854 0.016968 )
( 10.5 1.5097 0.01911 )
( 11 1.54796 0.021718 )
( 11.5 1.58012 0.02574 )
( 12 1.60666 0.030738 )
( 12.5 1.63054 0.036954 )
( 13 1.6126 0.048616 )
( 13.5 1.59578 0.060048 )
( 14 1.57596 0.073446 )
( 14.5 1.56354 0.08981 )
( 15 1.55248 0.107811 )
( 15.5 1.5399 0.126496 )
( 16 1.5274 0.14587 )
( 16.5 1.5089 0.165434 )
( 17 1.49274 0.184782 )
( 17.5 1.4798 0.204276 )
( 18 1.46692 0.22666 )
( 18.5 1.46803 0.244397 )
( 19 1.47484 0.261868 )
( 19.5 1.48554 0.278364 )
( 20 1.50154 0.293452 )
( 20.5 1.51218 0.309424 )
( 21 1.51636 0.325548 )
( 22 1.5079 0.360188 )
( 23 1.49682 0.395752 )
( 24 1.48512 0.432016 )
( 25 1.47304 0.46878 )
( 26 1.46034 0.505906 )
( 28 1.43808 0.580548 )
( 30 1.42434 0.65467 )
( 32 1.42412 0.72701 )
( 35 1.4376 0.832522 )
( 40 1.42602 1.002462 )
( 45 1.37448 1.159054 )
( 50 1.2886 1.296382 )
( 55 1.173 1.40934 )
( 60 1.0343 1.493722 )
( 65 0.87898 1.54667 )
( 70 0.71466 1.566322 )
( 75 0.54682 1.552826 )
( 80 0.38308 1.508898 )
( 85 0.23092 1.444524 )
( 90 0.09758 1.400186 )
( 95 -0.02504 1.40112 )
( 100 -0.14566 1.386992 )
( 105 -0.26328 1.357902 )
( 110 -0.3759 1.31405 )
( 115 -0.48114 1.255974 )
( 120 -0.57614 1.184236 )
( 125 -0.65938 1.099774 )
( 130 -0.727 1.003888 )
( 135 -0.77762 0.897978 )
( 140 -0.80824 0.784044 )
( 145 -0.81686 0.664486 )
( 150 -0.79886 0.542166 )
( 155 -0.75248 0.420598 )
( 160 -0.67548 0.304092 )
( 170 -0.4664 0.107208 )
( 175 -0.2461 0.046364 )
( 180 0 0.03538 )
); // // // //
