OF21x/ALM21/constant/turbineProperties/NREL5MWRef
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbineProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
TSR			    7.51; //This is only used for the tip correction of Shen
NumBl                       3;
TipRad                     63.0;
HubRad                      1.5;
UndSling                    0.0;
OverHang                   -5.01910;
TowerHt                    87.6;
Twr2Shft                    2.4;
ShftTilt                    0.0;
PreCone                  (0 0 0);
GBRatio                    97.0;
GBEfficiency                0.96;
GenEfficiency               0.96;
RatedRotSpeed              9.155;
GenIner                   534.116;
HubIner                   115.926E3;
BladeIner                  11.776047E6;
GenTorqueControllerType    "none";
BladePitchControllerType   "none";
NacYawControllerType       "none";

RotSpeedLimiter             false;
GenTorqueRateLimiter        false;
NacYawRateLimiter           false;
BladePitchRateLimiter       false;
SpeedFilterCornerFrequency  2.0;


GenTorqueControllerParams
{
    RateLimitGenTorque       15.0E3;
    SpeedTorqueTable
    (
        //      gen speed (RPM) gen torque (N-m)
        (       670.00              0.0 )
        (       871.00          20000.0 )
        (       1161.96         32000.0 )
        (       1173.70         43093.6 )
    );
    CutInGenSpeed           670.0;
    Region2StartGenSpeed    871.0;
    Region2EndGenSpeed     1161.963;
    CutInGenTorque            0.0;
    RatedGenTorque           43.09355E3;
    KGen                      2.55764E-2;
}

BladePitchControllerParams
{
    RateLimitBladePitch       4.500;
    PitchMin                  0.000;
    PitchMax                 80.000;
    PitchK                    6.302336;
    PitchControlKP            1.82620057;
    PitchControlKI            0.78265750;
    PitchControlKD            0.000;
}

NacYawControllerParams
{
    RateLimitNacYaw           2.0;
}




Airfoils
(
    "Cylinder1" 
    "DU930-OF" 
     "DU780-OF" 
     "DU610-OF" 
     "DU477-OF" 
     "DU430-OF" 
     "DU383-OF" 
     "DU357-OF" 
     "DU331-OF" 
     "DU290-OF"
     "DU260-OF"
     "DU238-OF" 
     "DU219-OF"   
     "DU202-OF" 
     "DU191-OF" 
    "NACA64_A17"
);


BladeData
(
//  radius(m)   c(m)     twist(deg) airfoil 
(	1.512	3.528	13.308	0	)
(	1.953	3.528	13.308	0	)
(	3.402	3.654	13.302	1	)
(	5.544	3.906	13.308	2	)
(	8.631	4.158	13.308	3	)
(	11.781	4.536	13.308	4	)
(	13.828	4.599	12.394	5	)
(	15.876	4.662	11.48	6	)
(	17.9235	4.536	10.821	7	)
(	19.971	4.41	10.162	8	)
(	24.066	4.284	9.011	9	)
(	28.161	4.032	7.795	10	)
(	32.256	3.78	6.544	11	)
(	36.351	3.528	5.361	12	)
(	40.446	3.276	4.188	13	)
(	42.4935	3.15	3.6565	14	)
(	44.541	3.024	3.125	15	)
(	48.636	2.772	2.319	15	)
(	52.731	2.52	1.526	15	)
(	56.196	2.268	0.863	15	)
(	58.905	2.142	0.37	15	)
(	61.614	1.386	0.106	15	)
(	61.929	1.26	0.082	15	)
(	62.244	1.134	0.06	15	)
(	62.496	1.008	0.04	15	)
(	62.685	0.756	0.023	15	)
(	62.874	0.63	0.01	15	)
(	62.937	0.378	0.003	15	)
(	63	0.252	0	15	)
);
